#Блок 5

#Задание 1
a = int(input("Введите число: "))
if a < 0:
    print("Число не положительное")
elif a > 0:
    print("Число положительное")
else:
    print("Ошибка")

#Задания 2
a = int(input("Введите число: "))
if a % 2 == 0:
    print("Четное число")
else:
    print("Нечетное число")

#Задание 3
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
if a < b:
    print(f"{a} меньше {b}")
elif a > b:
    print(f"{a} больше {b}")
else:
    print(f"{a} и {b} равны")

#Задание 4
a = input("Введите пароль: ")
b = len(a)
if b < 8:
    print("Пароль не подходит по длине")
elif b >= 8:
    print("Пароль подходит по длине")
else:
    print("Ошибка")

#Задание 5
a = int(input("Введите возраст(10, 25 или 70): "))
if a == 10:
    print("Ребенок")
elif a == 25:
    print("Взрослый")
else:
    print("Пожилой")

#Задание 6
a = int(input("Введите число: "))
if a >= 10 and a <= 20:
    print(f"{a} находится в диапазоне от 10 до 20")
else:
    print(f"{a} не находится в диапазоне от 10 до 20")

#Задание 7
a = input("Введите команду: ")
if a == "да" or a == "yes":
    print("Команда принята")
else:
    print("Ошибка")

#Задание 8
a = input("Введите команду: ")
b = a.lower()
print(f"Нормальзированный ответ: {b}")
if b == "да" or b == "yes":
    print("Команда принята")
else:
    print("Ошибка")

#Задание 9
a = int(input("Введите свою оценку: "))
if a == 5:
    print("Отлично")
elif a == 4:
    print("Хорошо")
elif a == 3:
    print("Удовлетворительно")
elif a == 2:
    print("Плохо")

#Задание 10
a = input("Введите название: ")
b = int(input("Введите год: "))
c = int(input("Введите цену: "))
d = True

if a.strip() != "":
    print("Название: корректно")
else:
    print("Название: некорректно")
    d = False

if 1500 <= b <= 2026:
    print("Год: корректно")
else:
    print("Год: некорректно")
    d = False

if c > 0:
    print("Цена: корректно")
else:
    print("Цена: некорректно")
    d = False

if d:
    print("Книгу можно сохранить")
else:
    print("Книгу нельзя сохранить")