#Блок 2

#Задание 1
имя = "Анна"
возраст = 18
город = "Москва"
изучает_python = True

print(имя)
print(возраст)
print(город)
print(изучает_python)

#Задание 2
название = "Идиот"
автор = "Достоевский"
год = 1869
цена = 450.0
print(название)
print(автор)
print(год)
print(цена)

#Задание 3
старая = 450
новая = 499
print(f"Старая цена: {старая}")
print(f"Новая цена: {новая}")

#Задание 4
a = 5
b = 9
print(f" a = {b}")
print(f" b = {a}")

#Задание 5
print(type(10), type(10.0), type('10'), type(True), type(None))

#Задание 6
print("reader_name - допустимое")
print("2book - недопустимое: начинается с цифры")
print("class - недопустимое: служебное слово")

#Задание 7
x = "Идиот"
a = 1869
b = 450
print(f"Название = {x}")
print(f"Год = {a}")
print(f"Цена = {b}")

#Задание 8
print("10 - int")
print("10.0 - float")
print("'10' - str")

#Задание 9
товар1 = "Книга"
цена1 = 450
товар2 = "Журнал"
цена2 = 200
товар3 = "Альбом"
цена3 = 350
print(f"Товар: {товар1}, цена: {цена1}")
print(f"Товар: {товар2}, цена: {цена2}")
print(f"Товар: {товар3}, цена: {цена3}")

#Задание 10
название = "Идиот"
автор = "Достоевский"
год = 1869
жанр = "Роман"
цена = 450.0
в_наличии = True
isbn = 9780000000001
полка = "A-12"
print(f"Название: {название}")
print(f"Автор: {автор}")
print(f"Год: {год}")
print(f"Жанр: {жанр}")
print(f"Цена: {цена}")
print(f"В наличии: {в_наличии}")
print(f"ISBN: {isbn}")
print(f"Покла: {полка}")