#Блок 3

#Задание 1
name = input("Введите свое имя: ")
print(f"Привет, {name}!")

#Задание 2
a = int(input("Сколько вам лет: "))
b = a + 5
print(f"Через 5 лет вам будет {b}")

#Задание 3
a = int(input("Введите число 1: "))
b = int(input("Введите число 2: "))
print(a + b)

#Задание 4
ширина = int(input("Введите ширину: "))
высота = int(input("Введите высоту: "))
площадь = ширина * высота
print(f"Площадь: {площадь}")

#Задание 5
минуты = int(input("Введите кол-во минут: "))
часы = минуты //60
минуты2 = минуты %60
print(f"{часы} часа {минуты2} минут")

#Задание 6
рубли = int(input("Введите кол-во рублей: "))
курс = 100
конвертер = рубли / 100
print(f"{конвертер} единиц валюты")

#Задание 7
a = int(input("Введите число 1: "))
b = int(input("Введите число 2: "))
c = int(input("Введите число 3: "))
d = a + b + c
e = d / 3
print(f"Среднее: {e}")

#Задание 8
цена = 1000
скидка = 15
цена_скидки = цена * 15 / 100
к_оплате = цена - цена_скидки
print(f"Цена без скидки: {цена}")
print(f"Скидка: {цена_скидки}")
print(f"К оплате: {к_оплате}")

#Задание 9
a = input("Введите число 1: ")
b = input("Введите число 2: ")
print(a + b)
a2 = int(input("Введите число 1: "))
b2 = int(input("Введите число 2: "))

#Задание 10
товарр = "Книга"
ценаа = 500
количество = 3
скидкаа = 10
вся_цена = ценаа * количество
цена_скидки2 = вся_цена * скидкаа / 100
со_скидкой = вся_цена - цена_скидки2
print(f"Товар: {товарр}")
print(f"Цена: {ценаа}")
print(f"Количество: {количество}")
print(f"Скидка: {скидкаа}%")
print(f"Итого: {со_скидкой}")